---
kind: method
id: M:Autodesk.Revit.DB.ElementClassFilter.GetElementClass
source: html/f9052596-3973-e373-41f8-92425e2906fa.htm
---
# Autodesk.Revit.DB.ElementClassFilter.GetElementClass Method

The class for the filter.

## Syntax (C#)
```csharp
public Type GetElementClass()
```

## Returns
The class.